Tekla Open API Reference for Tekla Structures 2025
ReinforcementBaseAttributes Methods
The ReinforcementBase.ReinforcementBaseAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
ReinforcementBase.ReinforcementBaseAttributes Class
Tekla.Structures.Drawing Namespace